#language: ru

@tree

Функционал: Настройка тестовой базы

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Настройка тестовой базы

* Настроить интеграцию с 1С:Документооборот 
	И Я устанавливаю в константу "ИмяКонстанты" значение "https://rtits-cis-02.rtits.ru/ECM_PC1"
	И В командном интерфейсе я выбираю 'НСИ и администрирование' 'Интеграция с 1С:Документооборотом'
	Тогда открылось окно 'Интеграция с 1С:Документооборотом'
	И в поле с именем 'АдресВебСервиса1СДокументооборот' я ввожу текст 'https://rtits-cis-02.rtits.ru/ECM_PC1'
	И я перехожу к следующему реквизиту
	И я жду доступности элемента с именем "с именем 'ИспользоватьИнтеграциюС1СДокументооборот'" в течение 20 секунд
	И я изменяю флаг с именем 'ИспользоватьИнтеграциюС1СДокументооборот'
	И я изменяю флаг с именем 'ИспользоватьПроцессыИЗадачи1СДокументооборота'
	И я изменяю флаг с именем 'ИспользоватьСвязанныеДокументы1СДокументооборота'
	И я изменяю флаг с именем 'ИспользоватьСогласованиеЧерез1СДокументооборот'
	И я меняю значение переключателя с именем 'СпособХраненияПрисоединенныхФайлов' на 'Файлы в отдельных папках'
	И Я закрываю окно 'Интеграция с 1С:Документооборотом'
* Настроить том для записи новых файлов
	И Я запоминаю в переменную "ПутьККаталогуТома" значение "\\\\rtits-cis-02\\Doc\\ECM_PC1_Files\\"
	И Я запоминаю в переменную "ПутьККаталогуОсновногоТома" значение "\\\\rtits-fs-02.rtits.ru\\1c_Doc$\\ERP_Files\\2025\\"
	И В командном интерфейсе я выбираю 'НСИ и администрирование' 'Настройки работы с файлами'
	Тогда открылось окно 'Настройки работы с файлами'
	И я нажимаю на кнопку с именем 'СправочникТомаХраненияФайлов'
	Тогда открылось окно 'Тома хранения файлов'
	И я программно изменяю элемент справочника 'ТомаХраненияФайлов' с 'ПолныйПутьWindows' равным '$ПутьККаталогуОсновногоТома$' установив реквизиты
		| 'ПорядокЗаполнения' | 556 |
	Если не существует элемент справочника "ТомаХраненияФайлов" с "Наименование" равным "Том для записи в тестовой базе" Тогда
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно 'Том хранения файлов (создание)'
		И в поле с именем 'Наименование' я ввожу текст 'Том для записи в тестовой базе'
		И я создаю каталог "$ПутьККаталогуТома$"
		И в поле с именем 'ПолныйПутьWindows' я ввожу текст '$ПутьККаталогуТома$'
		И в поле с именем 'Порядок' я ввожу текст '0'
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я жду закрытия окна 'Том хранения файлов (создание) *' в течение 20 секунд
		Тогда таблица "Список" содержит строки:
			| 'Наименование'                   | 'Порядок' |
			| 'Том для записи в тестовой базе' | ''        |
	Если существует элемент справочника "ТомаХраненияФайлов" с "Наименование" равным "Том для записи в тестовой базе" Тогда
		И я программно изменяю элемент справочника 'ТомаХраненияФайлов' с 'Наименование' равным 'Том для записи в тестовой базе' установив реквизиты
			| 'ПорядокЗаполнения' | 0 |	
		Тогда таблица "Список" содержит строки:
			| 'Наименование'                   | 'Порядок' |
			| 'Том для записи в тестовой базе' | ''        |
	
	
		
	
		
