#language: ru

@tree

Функционал: Тест шагов в ДО

Сценарий: Тест шагов в ДО

* тест1
	Когда В панели разделов я выбираю 'Настройка и администрирование'
	И Я нажимаю кнопку командного интерфейса 'Настройка программы'
	Тогда открылось окно 'Настройка программы'
	И я перехожу к закладке с именем "СтраницаРаботаСФайлами"
	И я нажимаю на кнопку с именем 'ОткрытьТомаХраненияФайлов'
	Тогда открылось окно 'Тома хранения файлов'
	И в таблице "Список" я перехожу к строке:
		| 'Наименование'                                   | 'Полный путь Microsoft Windows'                  | 'Порядок заполнения' |
		| '\\\\rtits-fs-02.rtits.ru\\1c_Doc$\\Doc_Files\\2025\\' | '\\\\rtits-fs-02.rtits.ru\\1c_Doc$\\Doc_Files\\2025\\' | '1'                  |
	И в таблице "Список" я добавляю строку
	Тогда открылось окно 'Том хранения файлов (создание)'
	И в поле с именем 'ПолныйПутьWindows' я ввожу текст '\\\\rtits-cis-02\\Doc\\ECM_Production_Copy_Files'
	И в поле с именем 'Наименование' я ввожу текст '\\\\rtits-cis-02\\Doc\\ECM_Production_Copy_Files'
	И в поле с именем 'Порядок' я ввожу текст '0'
	И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
	И я жду закрытия окна 'Том хранения файлов (создание) *' в течение 20 секунд
		
* тест 2
	И Я устанавливаю в константу "РТ_АдресВэбСервисаЛимитов" значение "Установлено из шага Ванессы"
	